---
kind: type
id: T:Autodesk.Revit.DB.DimensionType
source: html/a6f6655d-3383-a0ea-670d-0bbe6d2bb964.htm
---
# Autodesk.Revit.DB.DimensionType

An object that represents a dimension style.

## Syntax (C#)
```csharp
public class DimensionType : ElementType
```